In [1]:
%matplotlib inline

In [2]:
import matplotlib.pyplot as plt
import pandas as pd

In [3]:
# Files to load
city_data_to_load = "resources/city_data.csv"
ride_data_to_load = "resources/ride_data.csv"

In [4]:
city_data_df = pd.read_csv(city_data_to_load)
city_data_df.head()

           city  driver_count   type
0   Richardfort            38  Urban
1  Williamsstad            59  Urban
2   Port Angela            67  Urban
3    Rodneyfort            34  Urban
4   West Robert            39  Urban

In [5]:
ride_data_df = pd.read_csv(ride_data_to_load)
ride_data_df.head()

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2  Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3          Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4          South Jack  2019-03-06 04:28:35  34.58  3908451377344

In [6]:
# Get city data rows and columns that are not null
city_data_df.count()

city            120
driver_count    120
type            120
dtype: int64

In [8]:
# ride_data_df.count()
ride_data_df.isnull().sum() # Should return 0 if there are null values

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [9]:
city_data_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [10]:
ride_data_df.dtypes

city        object
date        object
fare       float64
ride_id      int64
dtype: object

In [12]:
# Check city types
city_data_df["type"].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [15]:
# Get number of data points for each city types
city_data_point_quantity = sum(city_data_df["type"] == "Urban")
suburban_data_point_quantity = sum(city_data_df["type"] == "Suburban")
rural_data_point_quantity = sum(city_data_df["type"] == "Rural")

print(city_data_point_quantity, suburban_data_point_quantity, rural_data_point_quantity)

66 36 18

In [17]:
# Get number of non-null rides
ride_data_df.count()
ride_data_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [18]:
ride_data_df.dtypes

city        object
date        object
fare       float64
ride_id      int64
dtype: object

In [21]:
# Merge the two data set
pyber_data_df = pd.merge(city_data_df,ride_data_df,how="left",on=["city","city"])
pyber_data_df.head(10)

          city  driver_count   type                 date   fare        ride_id
0  Richardfort            38  Urban  2019-02-24 08:40:38  13.93  5628545007794
1  Richardfort            38  Urban  2019-02-13 12:46:07  14.00   910050116494
2  Richardfort            38  Urban  2019-02-16 13:52:19  17.92   820639054416
3  Richardfort            38  Urban  2019-02-01 20:18:28  10.26  9554935945413
4  Richardfort            38  Urban  2019-04-17 02:26:37  23.00   720020655850
5  Richardfort            38  Urban  2019-04-21 03:44:04   9.54  3698147103219
6  Richardfort            38  Urban  2019-02-03 00:14:26  29.04  4982665519010
7  Richardfort            38  Urban  2019-02-08 15:50:12  16.55  2270463070874
8  Richardfort            38  Urban  2019-04-03 15:07:34  40.77  9496210735824
9  Richardfort            38  Urban  2019-02-19 14:09:20  27.11  8690324801449